[
    {
        "name": "Scenario 1",
        "title": "Repeat complaint - Update impact - High CLV - Make offer",
        "call_event_id": 1,
        "customer": {
            "name": "Porter Osborne",
            "customer_id": 7,
            "clv": "High"
        },
        "product": {
            "name": "AutoMow 3000",
            "type": "Self-Driving Mower"
        },
        "dates": {
            "primary_call_date": "2024-01-10",
            "previous_call_dates": ["2024-01-09"]
        },
        "scenario_details": {
            "call_reason": "Customer complaint: Their lawnmower is not working and has not functioned since yesterday.",
            "call_history_analysis": "The Historic_Calls database shows that the customer called yesterday about the same issue and was told it would be resolved by today. This is a repeat call due to an unresolved issue.",
            "operational_insight": "The Software_Updates database indicates a major update was rolled out yesterday for the AutoMow 3000. The issue may be linked to the update, suggesting a possible fault introduced on the company’s end.",
            "customer_insights_and_retention_strategy": "The customer is marked as High CLV. The Discount database indicates a 20% discount for 6 months is available for high CLV customers using this product. It is recommended to offer this discount as a goodwill gesture.",
            "recommended_system_response": [
                "Acknowledge the repeat issue and apologize for the inconvenience.",
                "Confirm that a recent major update might have impacted the product’s functionality.",
                "Reassure the customer that the issue is being prioritized.",
                "Offer: 'As a valued customer, we’re offering you a 20% discount for the next 6 months on your lawnmower subscription.'"
            ]
        }
    },
    {
        "name": "Scenario 2",
        "title": "Not repeat complaint - No offer",
        "call_event_id": 2,
        "customer": {
            "name": "Andrew Lyons",
            "customer_id": 22,
            "clv": "High"
        },
        "product": {
            "name": "HedgeBot Compact",
            "type": "Robotic Trimmer"
        },
        "dates": {
            "primary_call_date": "2025-02-15",
            "previous_call_dates": ["2025-02-13"]
        },
        "scenario_details": {
            "call_reason": "HedgeBot Compact is not turning on.",
            "call_history_analysis": "Customer called two days ago inquiring about an offer on the Aquaspray X. This deal had already expired, and the customer was recommended to sign up to the email list to receive future offers. As this is an unrelated reason for calling, this is not a repeat call.",
            "operational_insight": "No relevant operational insights.",
            "customer_insights_and_retention_strategy": "Customer is marked as high CSV. But since this is not a repeat call, flow should never reach this stage and no offer should be made.",
            "recommended_system_response": [
                "As this is no repeat call, do not offer a discount.", 
                "Find out what the customer is calling about and assist them with their inquiry."
            ]
        }
    },
    {
        "name": "Scenario 3",
        "title": "Repeat complaint (21 days) - Update impact - Low CLV - No offer",
        "call_event_id": 3,
        "customer": {
            "name": "Saul Brandt",
            "customer_id": 37,
            "clv": "Low"
        },
        "product": {
            "name": "AutoMow Mini",
            "type": "Self-Driving Mower"
        },
        "dates": {
            "primary_call_date": "2024-10-15",
            "previous_call_dates": ["2024-10-10", "2024-10-12", "2024-9-24"]
        },
        "scenario_details": {
            "call_reason": "Issue with the Automow is still persisting. Customer is frustrated.",
            "call_history_analysis": "Customer called multiple times over the last month about the same issue. At first it seemed like a fluke, but the AutoMow Mini seems to be turning off randomly while mowing. Before the first call, the issue was never there.",
            "operational_insight": "At 2024-9-20, there was a major software update for the AutoMow Mini. Looking at the timeline, it seems likely to be related to the customer issues.",
            "customer_insights_and_retention_strategy": "The customer is marked as low CLV. The database indicates that low CLV customers are not eligible for discounts.",
            "recommended_system_response": [
                "Acknowledge the repeat issue and apologize for the inconvenience.", 
                "Confirm that a recent major update might have impacted the product’s functionality.", 
                "Reassure the customer that the issue is being prioritized."
            ]
        }
    }
]